cask_args appdir: '/Applications'

tap 'homebrew/bundle'

brew 'ack'
brew 'ansible'
brew 'autoconf'
brew 'bash-git-prompt'
brew 'coreutils'
brew 'gdm'
brew 'gnupg'
brew 'go'
brew 'grc'
brew 'htop'
brew 'imagemagick'
brew 'jp2a'
brew 'jq'
brew 'ldns'
brew 'libgit2'
brew 'libyaml'
brew 'ncdu'
brew 'node'
brew 'openssl'
brew 'p7zip'
brew 'pcre'
brew 'pkg-config'
brew 'postgresql'
brew 'rbenv'
brew 'readline'
brew 'roundup'
brew 'ruby-build'
brew 'shellcheck'
brew 'spaceman-diff'
brew 'tmux'
brew 'tree'
brew 'unrar'
brew 'wget'
brew 'yarn'
brew 'youtube-dl'
brew 'zsh'

cask 'appcleaner'      # Application cleanup
cask 'atom'            # Text editor
cask 'bettertouchtool' # Key and gesture customization
cask 'ccleaner'         # Tempfile cleaner
cask 'filezilla'       # File transfer
cask 'firefox'         # Web browser
cask 'google-chrome'   # Web browser
cask 'handbrake'       # Video encoder
cask 'iterm2'          # Terminal replacement
cask 'karabiner'       # Key modification tool
cask 'scroll-reverser' # Alternate scrolling per input device
cask 'slack'           # Instant messenger
cask 'steam'           # Game distribution platform
cask 'vlc'             # Media player
cask 'broomstick'      # Hide menubar items
